int a = 270;
double res = Math.Cos(a);
System.Console.WriteLine(res);
// написать программу вычисления значения функции y=f(a) =>y=sin(a);